#pragma once

#include "Employee.h"
#include "WorkTime.h"

/* ==================== [Работник по найму] ==================== */
// * с оплатой за фактически отработанное время (имеет ставку за час)

class Personal : public Employee, public WorkTime
{
protected:
	/* ==================== [Переменные] ==================== */
	int base; // ставка

public:
	/* ==================== [Методы] ==================== */
	Personal() {} // конструктор по умолчанию

				  /* ========== [Метод: установить базовую ставку ] ========== */
	void setBase(int base)
	{
		this->base = base; // руб./час
	}

	/* ========== [Метод: получить базовую ставку ] ========== */
	int getBase() const
	{
		return base;
	}

	~Personal() {} // деструктор
};

